{
  "blogPosts": [
    {
      "id": "packingandpreparations",
      "createdOn": "2023-06-30T12:42:44.117651",
      "title": "Packing and Preparations",
      "body": "Even though I've had since November to plan for this trip, the past couple days have felt really crammed. No matter how many Target runs I had each week, there was always something else I needed to buy. Moving out of my apartment at th the same time definitely did not help my packing processs-- it was tricky to hunt down my clothes and supplies when they were scattered across the random bags and boxes that were nearly bursting out of my room. f After overpacking and panicking about my luggage size, I decided to switch to a carry-on suitcase instead of the small duffel bag I had been planning on bringing, leaving me with a large frame backpack, a suit-case, and a smaller backpack to lug around the airport by myself. I'm sure I packed way more than I needed to, but I'd rather deal with the sore arms thnow than be stuck without clothes in Romania. My other large dilemna was whether or not to spray my field clothes with permethrin, a super strength bug spray. It was recommended by my doctor and the CDC but not \nmentioned in any of the travel preparation information. The spraying process turned out to be a big pain (aeresol and stormy days aren't a good mix), and I'm not sure if I even did it right. Scary warnings about poison control and cancer took up most of the instructions on the can, but I dressed up in a ridiculous amount of layers and got the clothes covered in time. Still, I'd rather look dumb in front of the neighbors than contract tick-born encepalitus or lyme disease. \nGetting through the airport has been easier than I thought it would be so far. There was no line in TSA Pre-check, and I managed to get through without anyone yelling at me. I'm still worried for figuring out how baggage claim and customs work, so hopefully the other airports go as smoothly as this one did. All in all, I thought I would be way more nervous than I am. I think I was freaking out for my field school much more last summer than I am for this one. I shouldn't jinx myself though-- I've got a lot of travelling left to do before I'm in the clear. ",
      "imagePath": "/images/blog_posts/packingandpreparations.png"
    }
  ]
}